In [1]:
from io import StringIO
import pandas as pd

In [2]:
data = '''
团队  第一年 第二年
A1  1   
A2  2   16
A3      17
A4  8   20
A5  5   
A6  6   8
A7      
A8  10  23
'''

In [3]:
df = pd.read_csv(StringIO(data))
df

  团队  第一年 第二年
0    A1  1
1  A2  2   16
2  A3      17
3  A4  8   20
4    A5  5
5   A6  6   8
6    A7
7  A8  10  23

In [4]:
df = pd.read_csv(StringIO(data), delim_whitespace=True)
df

   团队   第一年   第二年
0  A1   1.0   NaN
1  A2   2.0  16.0
2  A3  17.0   NaN
3  A4   8.0  20.0
4  A5   5.0   NaN
5  A6   6.0   8.0
6  A7   NaN   NaN
7  A8  10.0  23.0

In [5]:
ser = df.iloc[6]
ser

团队      A7
第一年    NaN
第二年    NaN
Name: 6, dtype: object

In [6]:
ser.isna()

团队     False
第一年     True
第二年     True
Name: 6, dtype: bool

In [7]:
ser[ser.isna()]

第一年    NaN
第二年    NaN
Name: 6, dtype: object

In [8]:
ser[ser.isna()].index

Index(['第一年', '第二年'], dtype='object')

In [9]:
'和'.join(ser[ser.isna()].index)

'第一年和第二年'

In [10]:
(
    df.assign(foo=df.apply(lambda ser: ser[ser.isna()].index,axis=1))
    .assign(foo=lambda d: d.foo.map('和'.join))
)

   团队   第一年   第二年      foo
0  A1   1.0   NaN      第二年
1  A2   2.0  16.0
2  A3  17.0   NaN      第二年
3  A4   8.0  20.0
4  A5   5.0   NaN      第二年
5  A6   6.0   8.0
6  A7   NaN   NaN  第一年和第二年
7  A8  10.0  23.0

In [12]:
df.assign(foo=df.apply(lambda ser: ser[ser.isna()].index,axis=1))

   团队   第一年   第二年                                    foo
0  A1   1.0   NaN         Index(['第二年'], dtype='object')
1  A2   2.0  16.0              Index([], dtype='object')
2  A3  17.0   NaN         Index(['第二年'], dtype='object')
3  A4   8.0  20.0              Index([], dtype='object')
4  A5   5.0   NaN         Index(['第二年'], dtype='object')
5  A6   6.0   8.0              Index([], dtype='object')
6  A7   NaN   NaN  Index(['第一年', '第二年'], dtype='object')
7  A8  10.0  23.0              Index([], dtype='object')